exercises.org
#+TITLE: Knowledge Representation and Engineering - Exercises
#+AUTHOR:
#+LATEX_CLASS_OPTIONS: [a4paper,10pt,twoside,twocolumn]
* Introduction and Concepts

- Exercise 1 :: What is =data=? What is =information=? What is =knowledge=?
  - Data :: A raw value without context, it simply exists in its form (either usable or not)
  - Information :: Data + Meaning, it can change the perception of the receiver about something
    - Meanings :: The =five C's of Davenport & Prusak= describe what can give meaning to data
      - Contextualization :: Purpose of data
      - Categorization :: Classified or generalization to concepts
      - Calculation :: Mathematical or statistical analysis
      - Correction :: Removal of erros
      - Condensation :: Removal of unnecessary elements
  - Knowledge :: Information + "something", generalized to increase applicability. What is "something"?
    - The =four C's of Davenport & Prusak= describe what "something" can be
      - Comparison :: Similarity to other contexts
      - Consequence :: Implication in decision taking
      - Connection :: Relationship with other information
      - Conversation :: Feedback of people
    - Tobin :: "something" = application
- Exercises 2 :: Identify the underlined sentences of the following paragraphs as =data=, =information= or =knowledge=.
- Exercise 3 :: Identify =know-what= and =know-how= knowledge

About the following exercises
- Exercises 2 and 3 are grouped together for convenience
- The paragraphs are already splitted into separate sentences for the same reason
- We adopt these conventions: _this is data_ ~this is its meaning~
  + Knowledge :: extracted from the sentence above
  + Know-what :: if the extracted knowledge can be interpreted as a fact
  + Know-how :: if the extracted knowledge can be interpreted as a rule

