exercises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-26 vie 11:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Knowledge Representation and Engineering - Exercises</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Knowledge Representation and Engineering - Exercises</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org96e2c24">1. Introduction and Concepts</a>
<ul>
<li><a href="#orge935ea5">1.1. 2a and 3a</a></li>
<li><a href="#orgfc5f6a8">1.2. 2b and 3b</a></li>
<li><a href="#org19b5ecd">1.3. 2c and 3c</a></li>
<li><a href="#org7647b4d">1.4. 2d and 3d</a></li>
<li><a href="#org3c41cc8">1.5. 2e and 3e</a></li>
<li><a href="#orgd5106e5">1.6. 2f and 3f</a></li>
<li><a href="#org212ecaa">1.7. 2g and 3g</a></li>
<li><a href="#org9dfa5d8">1.8. 2h and 3h</a></li>
</ul>
</li>
<li><a href="#org34bed79">2. <span class="todo TODO">TODO</span> Knowledge Representation</a></li>
<li><a href="#org2609371">3. <span class="todo TODO">TODO</span> Knowledge Engineering</a></li>
<li><a href="#orgbc5c9b7">4. <span class="todo TODO">TODO</span> Knowledge Representation in the Web</a></li>
</ul>
</div>
</div>
<div id="outline-container-org96e2c24" class="outline-2">
<h2 id="org96e2c24"><span class="section-number-2">1</span> Introduction and Concepts</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt>Exercise 1</dt><dd>What is <code>data</code>? What is <code>information</code>? What is <code>knowledge</code>?
<dl class="org-dl">
<dt>Data</dt><dd>A raw value without context, it simply exists in its form (either usable or not)</dd>
<dt>Information</dt><dd>Data + Meaning, it can change the perception of the receiver about something
<dl class="org-dl">
<dt>Meanings</dt><dd>The <code>five C's of Davenport &amp; Prusak</code> describe what can give meaning to data
<dl class="org-dl">
<dt>Contextualization</dt><dd>Purpose of data</dd>
<dt>Categorization</dt><dd>Classified or generalization to concepts</dd>
<dt>Calculation</dt><dd>Mathematical or statistical analysis</dd>
<dt>Correction</dt><dd>Removal of erros</dd>
<dt>Condensation</dt><dd>Removal of unnecessary elements</dd>
</dl></dd>
</dl></dd>
<dt>Knowledge</dt><dd>Information + &ldquo;something&rdquo;, generalized to increase applicability. What is &ldquo;something&rdquo;?
<ul class="org-ul">
<li>The <code>four C's of Davenport &amp; Prusak</code> describe what &ldquo;something&rdquo; can be
<dl class="org-dl">
<dt>Comparison</dt><dd>Similarity to other contexts</dd>
<dt>Consequence</dt><dd>Implication in decision taking</dd>
<dt>Connection</dt><dd>Relationship with other information</dd>
<dt>Conversation</dt><dd>Feedback of people</dd>
</dl></li>
<li id="Tobin">&ldquo;something&rdquo; = application</li>
</ul></dd>
</dl></dd>
<dt>Exercises 2</dt><dd>Identify the underlined sentences of the following paragraphs as <code>data</code>, <code>information</code> or <code>knowledge</code>.</dd>
<dt>Exercise 3</dt><dd>Identify <code>know-what</code> and <code>know-how</code> knowledge</dd>
</dl>

<p>
About the following exercises
</p>
<ul class="org-ul">
<li>Exercises 2 and 3 are grouped together for convenience</li>
<li>The paragraphs are already splitted into separate sentences for the same reason</li>
<li>We adopt these conventions: <span class="underline">this is data</span> <code>this is its meaning</code>
<dl class="org-dl">
<dt>Knowledge</dt><dd>extracted from the sentence above</dd>
<dt>Know-what</dt><dd>if the extracted knowledge can be interpreted as a fact</dd>
<dt>Know-how</dt><dd>if the extracted knowledge can be interpreted as a rule</dd>
</dl></li>
</ul>
</div>
