exercises.tex
% Created 2021-02-26 vie 09:23
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,10pt,twoside,twocolumn]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\date{\today}
\title{Knowledge Representation and Engineering - Exercises}
\hypersetup{
 pdfauthor={},
 pdftitle={Knowledge Representation and Engineering - Exercises},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Introduction and Concepts}
\label{sec:orgc4bf679}

\begin{description}
\item[{Exercise 1}] What is \texttt{data}? What is \texttt{information}? What is \texttt{knowledge}?
\begin{description}
\item[{Data}] A raw value without context, it simply exists in its form (either usable or not)
\item[{Information}] Data + Meaning, it can change the perception of the receiver about something
\begin{description}
\item[{Meanings}] The \texttt{five C's of Davenport \& Prusak} describe what can give meaning to data
\begin{description}
\item[{Contextualization}] Purpose of data
\item[{Categorization}] Classified or generalization to concepts
\item[{Calculation}] Mathematical or statistical analysis
\item[{Correction}] Removal of erros
\item[{Condensation}] Removal of unnecessary elements
\end{description}
\end{description}
\item[{Knowledge}] Information + ``something'', generalized to increase applicability. What is ``something''?
\begin{itemize}
\item The \texttt{four C's of Davenport \& Prusak} describe what ``something'' can be
\begin{description}
\item[{Comparison}] Similarity to other contexts
\item[{Consequence}] Implication in decision taking
\item[{Connection}] Relationship with other information
\item[{Conversation}] Feedback of people
\end{description}
\item[{Tobin}] ``something'' = application
\end{itemize}
\end{description}
\item[{Exercises 2}] Identify the underlined sentences of the following paragraphs as \texttt{data}, \texttt{information} or \texttt{knowledge}.
\item[{Exercise 3}] Identify \texttt{know-what} and \texttt{know-how} knowledge
\end{description}

About the following exercises
\begin{itemize}
\item Exercises 2 and 3 are grouped together for convenience
\item The paragraphs are already splitted into separate sentences for the same reason
\item We adopt these conventions: \uline{this is data} \texttt{this is its meaning}
\begin{description}
\item[{Knowledge}] extracted from the sentence above
\item[{Know-what}] if the extracted knowledge can be interpreted as a fact
\item[{Know-how}] if the extracted knowledge can be interpreted as a rule
\end{description}
\end{itemize}
