exercises.md

# Table of Contents

1.  [Introduction and Concepts](#org317fbb9)
    1.  [2a and 3a](#org622537c)
    2.  [2b and 3b](#orgfea08c4)
    3.  [2c and 3c](#org4877a1a)
    4.  [2d and 3d](#org2d7fd27)
    5.  [2e and 3e](#org2dd5cff)
    6.  [2f and 3f](#org9bf32bc)
    7.  [2g and 3g](#org8a85451)
    8.  [2h and 3h](#orgd53ef74)
2.  [Knowledge Representation](#orgec1dabe)
3.  [Knowledge Engineering](#orgbdcac3d)
4.  [Knowledge Representation in the Web](#org7a5ea9a)



<a id="org317fbb9"></a>

# Introduction and Concepts

-   **Exercise 1:** What is `data`? What is `information`? What is `knowledge`?
    -   **Data:** A raw value without context, it simply exists in its form (either usable or not)
    -   **Information:** Data + Meaning, it can change the perception of the receiver about something
        -   **Meanings:** The `five C's of Davenport & Prusak` describe what can give meaning to data
            -   **Contextualization:** Purpose of data
            -   **Categorization:** Classified or generalization to concepts
            -   **Calculation:** Mathematical or statistical analysis
            -   **Correction:** Removal of erros
            -   **Condensation:** Removal of unnecessary elements
    -   **Knowledge:** Information + &ldquo;something&rdquo;, generalized to increase applicability. What is &ldquo;something&rdquo;?
        -   The `four C's of Davenport & Prusak` describe what &ldquo;something&rdquo; can be
            -   **Comparison:** Similarity to other contexts
            -   **Consequence:** Implication in decision taking
            -   **Connection:** Relationship with other information
            -   **Conversation:** Feedback of people
        -   **Tobin:** &ldquo;something&rdquo; = application
-   **Exercises 2:** Identify the underlined sentences of the following paragraphs as `data`, `information` or `knowledge`.
-   **Exercise 3:** Identify `know-what` and `know-how` knowledge

About the following exercises

-   Exercises 2 and 3 are grouped together for convenience
-   The paragraphs are already splitted into separate sentences for the same reason
-   We adopt these conventions: <span class="underline">this is data</span> `this is its meaning`
    -   **Knowledge:** extracted from the sentence above
    -   **Know-what:** if the extracted knowledge can be interpreted as a fact
    -   **Know-how:** if the extracted knowledge can be interpreted as a rule
