exercises.org
** 2a and 3a

 1) This course of _Knowledge Representation and Engineering_ ~course name~ is composed of _three_ ~number of~ chapters:  _Introduction  and  Concepts_ ~chapter name~, _Knowledge  Representation_ ~chapter name~, and _Knowledge Engineering_ ~chapter name~.
    + Knowledge :: Knowledge Representation and Engineering is a course
    + Knowledge :: Knowledge Representation and Engineering is composed by three chapters
    + Knowledge :: Introduction and Concepts is a chapter of Knowledge Representation and Engineering
    + Knowledge :: Knowledge Representation Knowledge Representation and Engineering
    + Knowledge :: Knowledge Engineering chapter Knowledge Representation and Engineering
    + Know-what :: it's a fact
 2) It’s a _six_-credit ~number of~ course with _two_ ~number of~ week hours for theory and _two_ ~number of~ week hours for problems and practice.
    + Knowledge :: Knowledge Representation and Endineering is a six-credit course
    + Knowledge :: Knowledge Representation and Endineering has two week hours for theory
    + Knowledge :: Knowledge Representation and Endineering has two week hours for problems and practice
    + Know-what :: it's a fact
 3) Like all the other subjects in the master, _half_ ~amount~ of the practical hours will be off class.
    + Knowledge :: Knowledge Representation and Endineering is a subject of the master
    + Knowledge :: All the subjects in the master have half of the practical hours off class
    + Know-how :: it's a fact
 4) As the rest of subjects, KRE will be continuously evaluated.
    + Knowledge :: All the subjects in the master are continouosly evaluated
    + Know-what :: it's a fact
 5) Continuous evaluation in KRE will consist of _two_ ~amount of~ theoretical-practical tests, and _two_ ~amount of~ practical work deliveries.
    + Knowledge :: The continuous evaluation of Knowledge Representation and Endineering consists of two theoretical-practical tests, and two practical work deliveries
    + Know-what :: it's a fact
 6) The final mark will be calculated as _30%_ ~amount~ of the results of each one of the theoretical tests and _20%_ ~amount~ of each practical work.
    + Knowledge :: The final mark of Knowledge Representation and Endineering is 30% of the results of each one of the theoretical tests and 20% amount of each practical work
    + Know-how :: it's a rule
 7) For second evaluation, there will be a single exam.
    + Knowledge :: The second evaluation of Knowledge Representation and Endineering is a single exam
    + Know-what :: it's a fact

