exercises.html

<div id="outline-container-orge935ea5" class="outline-3">
<h3 id="orge935ea5"><span class="section-number-3">1.1</span> 2a and 3a</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>This course of <span class="underline">Knowledge Representation and Engineering</span> <code>course name</code> is composed of <span class="underline">three</span> <code>number of</code> chapters:  <span class="underline">Introduction  and  Concepts</span> <code>chapter name</code>, <span class="underline">Knowledge  Representation</span> <code>chapter name</code>, and <span class="underline">Knowledge Engineering</span> <code>chapter name</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Knowledge Representation and Engineering is a course</dd>
<dt>Knowledge</dt><dd>Knowledge Representation and Engineering is composed by three chapters</dd>
<dt>Knowledge</dt><dd>Introduction and Concepts is a chapter of Knowledge Representation and Engineering</dd>
<dt>Knowledge</dt><dd>Knowledge Representation Knowledge Representation and Engineering</dd>
<dt>Knowledge</dt><dd>Knowledge Engineering chapter Knowledge Representation and Engineering</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>It’s a <span class="underline">six</span>-credit <code>number of</code> course with <span class="underline">two</span> <code>number of</code> week hours for theory and <span class="underline">two</span> <code>number of</code> week hours for problems and practice.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Knowledge Representation and Endineering is a six-credit course</dd>
<dt>Knowledge</dt><dd>Knowledge Representation and Endineering has two week hours for theory</dd>
<dt>Knowledge</dt><dd>Knowledge Representation and Endineering has two week hours for problems and practice</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Like all the other subjects in the master, <span class="underline">half</span> <code>amount</code> of the practical hours will be off class.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Knowledge Representation and Endineering is a subject of the master</dd>
<dt>Knowledge</dt><dd>All the subjects in the master have half of the practical hours off class</dd>
<dt>Know-how</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>As the rest of subjects, KRE will be continuously evaluated.
<dl class="org-dl">
<dt>Knowledge</dt><dd>All the subjects in the master are continouosly evaluated</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Continuous evaluation in KRE will consist of <span class="underline">two</span> <code>amount of</code> theoretical-practical tests, and <span class="underline">two</span> <code>amount of</code> practical work deliveries.
<dl class="org-dl">
<dt>Knowledge</dt><dd>The continuous evaluation of Knowledge Representation and Endineering consists of two theoretical-practical tests, and two practical work deliveries</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>The final mark will be calculated as <span class="underline">30%</span> <code>amount</code> of the results of each one of the theoretical tests and <span class="underline">20%</span> <code>amount</code> of each practical work.
<dl class="org-dl">
<dt>Knowledge</dt><dd>The final mark of Knowledge Representation and Endineering is 30% of the results of each one of the theoretical tests and 20% amount of each practical work</dd>
<dt>Know-how</dt><dd>it&rsquo;s a rule</dd>
</dl></li>
<li>For second evaluation, there will be a single exam.
<dl class="org-dl">
<dt>Knowledge</dt><dd>The second evaluation of Knowledge Representation and Endineering is a single exam</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
</ol>
</div>
</div>
