exercises.tex

\subsection{2a and 3a}
\label{sec:org7528db7}

\begin{enumerate}
\item This course of \uline{Knowledge Representation and Engineering} \texttt{course name} is composed of \uline{three} \texttt{number of} chapters:  \uline{Introduction  and  Concepts} \texttt{chapter name}, \uline{Knowledge  Representation} \texttt{chapter name}, and \uline{Knowledge Engineering} \texttt{chapter name}.
\begin{description}
\item[{Knowledge}] Knowledge Representation and Engineering is a course
\item[{Knowledge}] Knowledge Representation and Engineering is composed by three chapters
\item[{Knowledge}] Introduction and Concepts is a chapter of Knowledge Representation and Engineering
\item[{Knowledge}] Knowledge Representation Knowledge Representation and Engineering
\item[{Knowledge}] Knowledge Engineering chapter Knowledge Representation and Engineering
\item[{Know-what}] it's a fact
\end{description}
\item It’s a \uline{six}-credit \texttt{number of} course with \uline{two} \texttt{number of} week hours for theory and \uline{two} \texttt{number of} week hours for problems and practice.
\begin{description}
\item[{Knowledge}] Knowledge Representation and Endineering is a six-credit course
\item[{Knowledge}] Knowledge Representation and Endineering has two week hours for theory
\item[{Knowledge}] Knowledge Representation and Endineering has two week hours for problems and practice
\item[{Know-what}] it's a fact
\end{description}
\item Like all the other subjects in the master, \uline{half} \texttt{amount} of the practical hours will be off class.
\begin{description}
\item[{Knowledge}] Knowledge Representation and Endineering is a subject of the master
\item[{Knowledge}] All the subjects in the master have half of the practical hours off class
\item[{Know-how}] it's a fact
\end{description}
\item As the rest of subjects, KRE will be continuously evaluated.
\begin{description}
\item[{Knowledge}] All the subjects in the master are continouosly evaluated
\item[{Know-what}] it's a fact
\end{description}
\item Continuous evaluation in KRE will consist of \uline{two} \texttt{amount of} theoretical-practical tests, and \uline{two} \texttt{amount of} practical work deliveries.
\begin{description}
\item[{Knowledge}] The continuous evaluation of Knowledge Representation and Endineering consists of two theoretical-practical tests, and two practical work deliveries
\item[{Know-what}] it's a fact
\end{description}
\item The final mark will be calculated as \uline{30\%} \texttt{amount} of the results of each one of the theoretical tests and \uline{20\%} \texttt{amount} of each practical work.
\begin{description}
\item[{Knowledge}] The final mark of Knowledge Representation and Endineering is 30\% of the results of each one of the theoretical tests and 20\% amount of each practical work
\item[{Know-how}] it's a rule
\end{description}
\item For second evaluation, there will be a single exam.
\begin{description}
\item[{Knowledge}] The second evaluation of Knowledge Representation and Endineering is a single exam
\item[{Know-what}] it's a fact
\end{description}
\end{enumerate}
