exercises.md


<a id="org622537c"></a>

## 2a and 3a

1.  This course of <span class="underline">Knowledge Representation and Engineering</span> `course name` is composed of <span class="underline">three</span> `number of` chapters:  <span class="underline">Introduction  and  Concepts</span> `chapter name`, <span class="underline">Knowledge  Representation</span> `chapter name`, and <span class="underline">Knowledge Engineering</span> `chapter name`.
    -   **Knowledge:** Knowledge Representation and Engineering is a course
    -   **Knowledge:** Knowledge Representation and Engineering is composed by three chapters
    -   **Knowledge:** Introduction and Concepts is a chapter of Knowledge Representation and Engineering
    -   **Knowledge:** Knowledge Representation Knowledge Representation and Engineering
    -   **Knowledge:** Knowledge Engineering chapter Knowledge Representation and Engineering
    -   **Know-what:** it&rsquo;s a fact
2.  It’s a <span class="underline">six</span>-credit `number of` course with <span class="underline">two</span> `number of` week hours for theory and <span class="underline">two</span> `number of` week hours for problems and practice.
    -   **Knowledge:** Knowledge Representation and Endineering is a six-credit course
    -   **Knowledge:** Knowledge Representation and Endineering has two week hours for theory
    -   **Knowledge:** Knowledge Representation and Endineering has two week hours for problems and practice
    -   **Know-what:** it&rsquo;s a fact
3.  Like all the other subjects in the master, <span class="underline">half</span> `amount` of the practical hours will be off class.
    -   **Knowledge:** Knowledge Representation and Endineering is a subject of the master
    -   **Knowledge:** All the subjects in the master have half of the practical hours off class
    -   **Know-how:** it&rsquo;s a fact
4.  As the rest of subjects, KRE will be continuously evaluated.
    -   **Knowledge:** All the subjects in the master are continouosly evaluated
    -   **Know-what:** it&rsquo;s a fact
5.  Continuous evaluation in KRE will consist of <span class="underline">two</span> `amount of` theoretical-practical tests, and <span class="underline">two</span> `amount of` practical work deliveries.
    -   **Knowledge:** The continuous evaluation of Knowledge Representation and Endineering consists of two theoretical-practical tests, and two practical work deliveries
    -   **Know-what:** it&rsquo;s a fact
6.  The final mark will be calculated as <span class="underline">30%</span> `amount` of the results of each one of the theoretical tests and <span class="underline">20%</span> `amount` of each practical work.
    -   **Knowledge:** The final mark of Knowledge Representation and Endineering is 30% of the results of each one of the theoretical tests and 20% amount of each practical work
    -   **Know-how:** it&rsquo;s a rule
7.  For second evaluation, there will be a single exam.
    -   **Knowledge:** The second evaluation of Knowledge Representation and Endineering is a single exam
    -   **Know-what:** it&rsquo;s a fact
