exercises.org
** 2b and 3b

 1) Computer _hardware_ ~part~ equals the collection of _physical_ ~type of~ elements that comprise a computer system.
    + Knowledge :: computer hardware is the collection of physical elements that comprise a computer system
    + Know-what :: it's a fact
 2) Computer hardware refers to the _physical_ ~type of~ parts or components of a computer such as _monitor_ ~part name~, _keyboard_ ~part name~, _hard drive disk_ ~component name~, _mouse_ ~part name~, _printers_ ~part name~, _graphic cards_ ~component~, _sound cards_ ~component name~, memory ~component name~, motherboard ~component name~ and chips ~component name~, etc. all of which are _physical_ ~type of~ objects that you can actually touch.
    + Knowledge :: computer hardware is a collection of physical elements that are parts/components of a computer system
    + Knowledge :: monitor, hard drive disk, mouse, printers, graphic cards, sound cards, memory, motherboard, chips are part of computer hardware
    + Know-what :: it's a fact
 3) In contrast, _software_ ~part~ is untouchable.
    + Knowledge :: software is untouchable
    + Know-what :: it's a fact
 4) Software exists as _ideas_ ~part of~, _application_ ~part of~, _concepts_ ~part of~, and _symbols_ ~part of~, but it has no substance.
    + Knowledge :: software made of ideas, application, concepts and symbols
    + Knowledge :: software has no substance
    + Know-what :: it's a fact
 5) A combination of _hardware_ ~part~ and _software_ ~part~ forms a usable computing system.
    + Knowledge :: a usable computing system is made by hardware and software
    + Know-what :: it's a fact

