exercises.html

<div id="outline-container-orgfc5f6a8" class="outline-3">
<h3 id="orgfc5f6a8"><span class="section-number-3">1.2</span> 2b and 3b</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Computer <span class="underline">hardware</span> <code>part</code> equals the collection of <span class="underline">physical</span> <code>type of</code> elements that comprise a computer system.
<dl class="org-dl">
<dt>Knowledge</dt><dd>computer hardware is the collection of physical elements that comprise a computer system</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Computer hardware refers to the <span class="underline">physical</span> <code>type of</code> parts or components of a computer such as <span class="underline">monitor</span> <code>part name</code>, <span class="underline">keyboard</span> <code>part name</code>, <span class="underline">hard drive disk</span> <code>component name</code>, <span class="underline">mouse</span> <code>part name</code>, <span class="underline">printers</span> <code>part name</code>, <span class="underline">graphic cards</span> <code>component</code>, <span class="underline">sound cards</span> <code>component name</code>, memory <code>component name</code>, motherboard <code>component name</code> and chips <code>component name</code>, etc. all of which are <span class="underline">physical</span> <code>type of</code> objects that you can actually touch.
<dl class="org-dl">
<dt>Knowledge</dt><dd>computer hardware is a collection of physical elements that are parts/components of a computer system</dd>
<dt>Knowledge</dt><dd>monitor, hard drive disk, mouse, printers, graphic cards, sound cards, memory, motherboard, chips are part of computer hardware</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>In contrast, <span class="underline">software</span> <code>part</code> is untouchable.
<dl class="org-dl">
<dt>Knowledge</dt><dd>software is untouchable</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Software exists as <span class="underline">ideas</span> <code>part of</code>, <span class="underline">application</span> <code>part of</code>, <span class="underline">concepts</span> <code>part of</code>, and <span class="underline">symbols</span> <code>part of</code>, but it has no substance.
<dl class="org-dl">
<dt>Knowledge</dt><dd>software made of ideas, application, concepts and symbols</dd>
<dt>Knowledge</dt><dd>software has no substance</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>A combination of <span class="underline">hardware</span> <code>part</code> and <span class="underline">software</span> <code>part</code> forms a usable computing system.
<dl class="org-dl">
<dt>Knowledge</dt><dd>a usable computing system is made by hardware and software</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
</ol>
</div>
</div>
