exercises.tex

\subsection{2b and 3b}
\label{sec:org61e6af4}

\begin{enumerate}
\item Computer \uline{hardware} \texttt{part} equals the collection of \uline{physical} \texttt{type of} elements that comprise a computer system.
\begin{description}
\item[{Knowledge}] computer hardware is the collection of physical elements that comprise a computer system
\item[{Know-what}] it's a fact
\end{description}
\item Computer hardware refers to the \uline{physical} \texttt{type of} parts or components of a computer such as \uline{monitor} \texttt{part name}, \uline{keyboard} \texttt{part name}, \uline{hard drive disk} \texttt{component name}, \uline{mouse} \texttt{part name}, \uline{printers} \texttt{part name}, \uline{graphic cards} \texttt{component}, \uline{sound cards} \texttt{component name}, memory \texttt{component name}, motherboard \texttt{component name} and chips \texttt{component name}, etc. all of which are \uline{physical} \texttt{type of} objects that you can actually touch.
\begin{description}
\item[{Knowledge}] computer hardware is a collection of physical elements that are parts/components of a computer system
\item[{Knowledge}] monitor, hard drive disk, mouse, printers, graphic cards, sound cards, memory, motherboard, chips are part of computer hardware
\item[{Know-what}] it's a fact
\end{description}
\item In contrast, \uline{software} \texttt{part} is untouchable.
\begin{description}
\item[{Knowledge}] software is untouchable
\item[{Know-what}] it's a fact
\end{description}
\item Software exists as \uline{ideas} \texttt{part of}, \uline{application} \texttt{part of}, \uline{concepts} \texttt{part of}, and \uline{symbols} \texttt{part of}, but it has no substance.
\begin{description}
\item[{Knowledge}] software made of ideas, application, concepts and symbols
\item[{Knowledge}] software has no substance
\item[{Know-what}] it's a fact
\end{description}
\item A combination of \uline{hardware} \texttt{part} and \uline{software} \texttt{part} forms a usable computing system.
\begin{description}
\item[{Knowledge}] a usable computing system is made by hardware and software
\item[{Know-what}] it's a fact
\end{description}
\end{enumerate}
