exercises.md


<a id="orgfea08c4"></a>

## 2b and 3b

1.  Computer <span class="underline">hardware</span> `part` equals the collection of <span class="underline">physical</span> `type of` elements that comprise a computer system.
    -   **Knowledge:** computer hardware is the collection of physical elements that comprise a computer system
    -   **Know-what:** it&rsquo;s a fact
2.  Computer hardware refers to the <span class="underline">physical</span> `type of` parts or components of a computer such as <span class="underline">monitor</span> `part name`, <span class="underline">keyboard</span> `part name`, <span class="underline">hard drive disk</span> `component name`, <span class="underline">mouse</span> `part name`, <span class="underline">printers</span> `part name`, <span class="underline">graphic cards</span> `component`, <span class="underline">sound cards</span> `component name`, memory `component name`, motherboard `component name` and chips `component name`, etc. all of which are <span class="underline">physical</span> `type of` objects that you can actually touch.
    -   **Knowledge:** computer hardware is a collection of physical elements that are parts/components of a computer system
    -   **Knowledge:** monitor, hard drive disk, mouse, printers, graphic cards, sound cards, memory, motherboard, chips are part of computer hardware
    -   **Know-what:** it&rsquo;s a fact
3.  In contrast, <span class="underline">software</span> `part` is untouchable.
    -   **Knowledge:** software is untouchable
    -   **Know-what:** it&rsquo;s a fact
4.  Software exists as <span class="underline">ideas</span> `part of`, <span class="underline">application</span> `part of`, <span class="underline">concepts</span> `part of`, and <span class="underline">symbols</span> `part of`, but it has no substance.
    -   **Knowledge:** software made of ideas, application, concepts and symbols
    -   **Knowledge:** software has no substance
    -   **Know-what:** it&rsquo;s a fact
5.  A combination of <span class="underline">hardware</span> `part` and <span class="underline">software</span> `part` forms a usable computing system.
    -   **Knowledge:** a usable computing system is made by hardware and software
    -   **Know-what:** it&rsquo;s a fact
