exercises.org
** 2c and 3c

 1) Primary care is the health care given by a _health care provider_ ~role~.
    + Knowledge :: primary care is health care
    + Knowlegde :: health care provider provides primary care
    + Know-what :: it's a fact
 2) Typically this provider acts as the principal point of consultation for _patients_ ~role~ within a health care system and coordinates other _specialists_ ~role~ that the patient may need.
    + Knowledge :: health care provider is the principal consultant for patients
    + Knowledge :: health care provider coordinates other specialists
    + Know-what :: it's a fact
 3) Such a professional can be a _primary care physician_ ~role~, such as a _general practitioner_ ~role~ or _family physician_ ~role~, or depending on the locality, health system organization, and patient's discretion, they may see a _pharmacist_ ~role~, a _physician assistant_ ~role~, a _nurse practitioner_ ~role~, a _nurse_ (such as in the _United Kingdom_ ~location)~, a _clinical officer_ ~role~ (such as in _parts of Africa_ ~location~), or an Ayurvedic or other _traditional medicine professional_ ~role~ (such as in _parts of Asia_ ~location~).
    + Knowledge :: primary care physician can be a health care provider
    + Knowledge :: general practitioner is a primary care physician
    + Knowledge :: family physician is a primary care physician
    + Knowledge :: pharmacist can be a health care provider
    + Knowledge :: physician assistant can be a health care provider
    + Knowledge :: nurse practitioner can be a health care provider
    + Knowledge :: nurse can be a health care provider in United Kingdom
    + Knowledge :: clinical officer can be a health care provider in parts of Africa
    + Knowledge :: traditional medicine professional can be a health care provider in parts of Asia
    + Know-how :: it's a rule, defining the process used to choose a primary care physician
 4) A _patient-centered_ ~type of~ primary care stores all the information about one patient in the different episodes of care (eoc).
    + Knowledge :: patient-centered primary care stores all the information about one patient in the different episodes of care (eoc)
    + Know-what :: it's a fact
 5) A _patient_ ~role~ has a _name_, _sex_ (M/W), _race_, and a _date of birth_ ~attributes of a patient~.
    + Knowledge :: name, sex, race and date of birth are attributes of a patient
    + Know-what :: it's a fact
 6) An eoc contains the _date when episode was created_ ~attribute of an eoc~, and a _sequence of encounters_ ~attribute of an eoc~ between the health care professional and the patient.
    + Knowledge :: date of creation and sequence of encounters with patient are attributes of a eoc
    + Know-what :: it's a fact
 7) Each encounter has a _date_ a _reference to the health care provider_ and a _set of treatments_ ~attributes of an encounter~.
    + Knowledge :: date, reference to health care provider, set of treatments are attributes of an encounter
    + Know-what :: it's a fact
 8) A treatment is composed of a set of findings ~part of treatment~ which are _textual_ ~type of~ descriptions of the patient signs and symptoms (for example, _fever_, _high blood pressure_, _breast pain_, ...).
    + Knowledge :: treatment has a set of findings
    + Knowledge :: set of findings collects textual descriptions of signs and symptoms
    + Knowledge :: fever, high blood pressure, breast pain are symptoms
    + Know-what :: its' a fact
 9) A treatment can have attached a _disease or set of diseases_ ~attribute of a treatment~ that the patient is treated of, and a set of _medical actions_ ~attribute of a treatment~ that can be of the sort: _pharmacological_, _test order_, _visit_ (to provider such as a specialist), or _recommendation_.
    + Knowledge :: treatment may have a set of diseases that the patient is treated of
    + Knowledge :: treatment may have a set of medical actions
    + Knowledge :: medical action can be pharmacological, test order, visit (to a specialist), or recommendation.
    + Know-what :: it's a fact

