exercises.html

<div id="outline-container-org19b5ecd" class="outline-3">
<h3 id="org19b5ecd"><span class="section-number-3">1.3</span> 2c and 3c</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Primary care is the health care given by a <span class="underline">health care provider</span> <code>role</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>primary care is health care</dd>
<dt>Knowlegde</dt><dd>health care provider provides primary care</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Typically this provider acts as the principal point of consultation for <span class="underline">patients</span> <code>role</code> within a health care system and coordinates other <span class="underline">specialists</span> <code>role</code> that the patient may need.
<dl class="org-dl">
<dt>Knowledge</dt><dd>health care provider is the principal consultant for patients</dd>
<dt>Knowledge</dt><dd>health care provider coordinates other specialists</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Such a professional can be a <span class="underline">primary care physician</span> <code>role</code>, such as a <span class="underline">general practitioner</span> <code>role</code> or <span class="underline">family physician</span> <code>role</code>, or depending on the locality, health system organization, and patient&rsquo;s discretion, they may see a <span class="underline">pharmacist</span> <code>role</code>, a <span class="underline">physician assistant</span> <code>role</code>, a <span class="underline">nurse practitioner</span> <code>role</code>, a <span class="underline">nurse</span> (such as in the <span class="underline">United Kingdom</span> <code>location)</code>, a <span class="underline">clinical officer</span> <code>role</code> (such as in <span class="underline">parts of Africa</span> <code>location</code>), or an Ayurvedic or other <span class="underline">traditional medicine professional</span> <code>role</code> (such as in <span class="underline">parts of Asia</span> <code>location</code>).
<dl class="org-dl">
<dt>Knowledge</dt><dd>primary care physician can be a health care provider</dd>
<dt>Knowledge</dt><dd>general practitioner is a primary care physician</dd>
<dt>Knowledge</dt><dd>family physician is a primary care physician</dd>
<dt>Knowledge</dt><dd>pharmacist can be a health care provider</dd>
<dt>Knowledge</dt><dd>physician assistant can be a health care provider</dd>
<dt>Knowledge</dt><dd>nurse practitioner can be a health care provider</dd>
<dt>Knowledge</dt><dd>nurse can be a health care provider in United Kingdom</dd>
<dt>Knowledge</dt><dd>clinical officer can be a health care provider in parts of Africa</dd>
<dt>Knowledge</dt><dd>traditional medicine professional can be a health care provider in parts of Asia</dd>
<dt>Know-how</dt><dd>it&rsquo;s a rule, defining the process used to choose a primary care physician</dd>
</dl></li>
<li>A <span class="underline">patient-centered</span> <code>type of</code> primary care stores all the information about one patient in the different episodes of care (eoc).
<dl class="org-dl">
<dt>Knowledge</dt><dd>patient-centered primary care stores all the information about one patient in the different episodes of care (eoc)</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>A <span class="underline">patient</span> <code>role</code> has a <span class="underline">name</span>, <span class="underline">sex</span> (M/W), <span class="underline">race</span>, and a <span class="underline">date of birth</span> <code>attributes of a patient</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>name, sex, race and date of birth are attributes of a patient</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>An eoc contains the <span class="underline">date when episode was created</span> <code>attribute of an eoc</code>, and a <span class="underline">sequence of encounters</span> <code>attribute of an eoc</code> between the health care professional and the patient.
<dl class="org-dl">
<dt>Knowledge</dt><dd>date of creation and sequence of encounters with patient are attributes of a eoc</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Each encounter has a <span class="underline">date</span> a <span class="underline">reference to the health care provider</span> and a <span class="underline">set of treatments</span> <code>attributes of an encounter</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>date, reference to health care provider, set of treatments are attributes of an encounter</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>A treatment is composed of a set of findings <code>part of treatment</code> which are <span class="underline">textual</span> <code>type of</code> descriptions of the patient signs and symptoms (for example, <span class="underline">fever</span>, <span class="underline">high blood pressure</span>, <span class="underline">breast pain</span>, &#x2026;).
<dl class="org-dl">
<dt>Knowledge</dt><dd>treatment has a set of findings</dd>
<dt>Knowledge</dt><dd>set of findings collects textual descriptions of signs and symptoms</dd>
<dt>Knowledge</dt><dd>fever, high blood pressure, breast pain are symptoms</dd>
<dt>Know-what</dt><dd>its&rsquo; a fact</dd>
</dl></li>
<li>A treatment can have attached a <span class="underline">disease or set of diseases</span> <code>attribute of a treatment</code> that the patient is treated of, and a set of <span class="underline">medical actions</span> <code>attribute of a treatment</code> that can be of the sort: <span class="underline">pharmacological</span>, <span class="underline">test order</span>, <span class="underline">visit</span> (to provider such as a specialist), or <span class="underline">recommendation</span>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>treatment may have a set of diseases that the patient is treated of</dd>
<dt>Knowledge</dt><dd>treatment may have a set of medical actions</dd>
<dt>Knowledge</dt><dd>medical action can be pharmacological, test order, visit (to a specialist), or recommendation.</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
</ol>
</div>
</div>
