exercises.tex

\subsection{2c and 3c}
\label{sec:orgbc51fda}

\begin{enumerate}
\item Primary care is the health care given by a \uline{health care provider} \texttt{role}.
\begin{description}
\item[{Knowledge}] primary care is health care
\item[{Knowlegde}] health care provider provides primary care
\item[{Know-what}] it's a fact
\end{description}
\item Typically this provider acts as the principal point of consultation for \uline{patients} \texttt{role} within a health care system and coordinates other \uline{specialists} \texttt{role} that the patient may need.
\begin{description}
\item[{Knowledge}] health care provider is the principal consultant for patients
\item[{Knowledge}] health care provider coordinates other specialists
\item[{Know-what}] it's a fact
\end{description}
\item Such a professional can be a \uline{primary care physician} \texttt{role}, such as a \uline{general practitioner} \texttt{role} or \uline{family physician} \texttt{role}, or depending on the locality, health system organization, and patient's discretion, they may see a \uline{pharmacist} \texttt{role}, a \uline{physician assistant} \texttt{role}, a \uline{nurse practitioner} \texttt{role}, a \uline{nurse} (such as in the \uline{United Kingdom} \texttt{location)}, a \uline{clinical officer} \texttt{role} (such as in \uline{parts of Africa} \texttt{location}), or an Ayurvedic or other \uline{traditional medicine professional} \texttt{role} (such as in \uline{parts of Asia} \texttt{location}).
\begin{description}
\item[{Knowledge}] primary care physician can be a health care provider
\item[{Knowledge}] general practitioner is a primary care physician
\item[{Knowledge}] family physician is a primary care physician
\item[{Knowledge}] pharmacist can be a health care provider
\item[{Knowledge}] physician assistant can be a health care provider
\item[{Knowledge}] nurse practitioner can be a health care provider
\item[{Knowledge}] nurse can be a health care provider in United Kingdom
\item[{Knowledge}] clinical officer can be a health care provider in parts of Africa
\item[{Knowledge}] traditional medicine professional can be a health care provider in parts of Asia
\item[{Know-how}] it's a rule, defining the process used to choose a primary care physician
\end{description}
\item A \uline{patient-centered} \texttt{type of} primary care stores all the information about one patient in the different episodes of care (eoc).
\begin{description}
\item[{Knowledge}] patient-centered primary care stores all the information about one patient in the different episodes of care (eoc)
\item[{Know-what}] it's a fact
\end{description}
\item A \uline{patient} \texttt{role} has a \uline{name}, \uline{sex} (M/W), \uline{race}, and a \uline{date of birth} \texttt{attributes of a patient}.
\begin{description}
\item[{Knowledge}] name, sex, race and date of birth are attributes of a patient
\item[{Know-what}] it's a fact
\end{description}
\item An eoc contains the \uline{date when episode was created} \texttt{attribute of an eoc}, and a \uline{sequence of encounters} \texttt{attribute of an eoc} between the health care professional and the patient.
\begin{description}
\item[{Knowledge}] date of creation and sequence of encounters with patient are attributes of a eoc
\item[{Know-what}] it's a fact
\end{description}
\item Each encounter has a \uline{date} a \uline{reference to the health care provider} and a \uline{set of treatments} \texttt{attributes of an encounter}.
\begin{description}
\item[{Knowledge}] date, reference to health care provider, set of treatments are attributes of an encounter
\item[{Know-what}] it's a fact
\end{description}
\item A treatment is composed of a set of findings \texttt{part of treatment} which are \uline{textual} \texttt{type of} descriptions of the patient signs and symptoms (for example, \uline{fever}, \uline{high blood pressure}, \uline{breast pain}, \ldots{}).
\begin{description}
\item[{Knowledge}] treatment has a set of findings
\item[{Knowledge}] set of findings collects textual descriptions of signs and symptoms
\item[{Knowledge}] fever, high blood pressure, breast pain are symptoms
\item[{Know-what}] its' a fact
\end{description}
\item A treatment can have attached a \uline{disease or set of diseases} \texttt{attribute of a treatment} that the patient is treated of, and a set of \uline{medical actions} \texttt{attribute of a treatment} that can be of the sort: \uline{pharmacological}, \uline{test order}, \uline{visit} (to provider such as a specialist), or \uline{recommendation}.
\begin{description}
\item[{Knowledge}] treatment may have a set of diseases that the patient is treated of
\item[{Knowledge}] treatment may have a set of medical actions
\item[{Knowledge}] medical action can be pharmacological, test order, visit (to a specialist), or recommendation.
\item[{Know-what}] it's a fact
\end{description}
\end{enumerate}
