exercises.md


<a id="org4877a1a"></a>

## 2c and 3c

1.  Primary care is the health care given by a <span class="underline">health care provider</span> `role`.
    -   **Knowledge:** primary care is health care
    -   **Knowlegde:** health care provider provides primary care
    -   **Know-what:** it&rsquo;s a fact
2.  Typically this provider acts as the principal point of consultation for <span class="underline">patients</span> `role` within a health care system and coordinates other <span class="underline">specialists</span> `role` that the patient may need.
    -   **Knowledge:** health care provider is the principal consultant for patients
    -   **Knowledge:** health care provider coordinates other specialists
    -   **Know-what:** it&rsquo;s a fact
3.  Such a professional can be a <span class="underline">primary care physician</span> `role`, such as a <span class="underline">general practitioner</span> `role` or <span class="underline">family physician</span> `role`, or depending on the locality, health system organization, and patient&rsquo;s discretion, they may see a <span class="underline">pharmacist</span> `role`, a <span class="underline">physician assistant</span> `role`, a <span class="underline">nurse practitioner</span> `role`, a <span class="underline">nurse</span> (such as in the <span class="underline">United Kingdom</span> `location)`, a <span class="underline">clinical officer</span> `role` (such as in <span class="underline">parts of Africa</span> `location`), or an Ayurvedic or other <span class="underline">traditional medicine professional</span> `role` (such as in <span class="underline">parts of Asia</span> `location`).
    -   **Knowledge:** primary care physician can be a health care provider
    -   **Knowledge:** general practitioner is a primary care physician
    -   **Knowledge:** family physician is a primary care physician
    -   **Knowledge:** pharmacist can be a health care provider
    -   **Knowledge:** physician assistant can be a health care provider
    -   **Knowledge:** nurse practitioner can be a health care provider
    -   **Knowledge:** nurse can be a health care provider in United Kingdom
    -   **Knowledge:** clinical officer can be a health care provider in parts of Africa
    -   **Knowledge:** traditional medicine professional can be a health care provider in parts of Asia
    -   **Know-how:** it&rsquo;s a rule, defining the process used to choose a primary care physician
4.  A <span class="underline">patient-centered</span> `type of` primary care stores all the information about one patient in the different episodes of care (eoc).
    -   **Knowledge:** patient-centered primary care stores all the information about one patient in the different episodes of care (eoc)
    -   **Know-what:** it&rsquo;s a fact
5.  A <span class="underline">patient</span> `role` has a <span class="underline">name</span>, <span class="underline">sex</span> (M/W), <span class="underline">race</span>, and a <span class="underline">date of birth</span> `attributes of a patient`.
    -   **Knowledge:** name, sex, race and date of birth are attributes of a patient
    -   **Know-what:** it&rsquo;s a fact
6.  An eoc contains the <span class="underline">date when episode was created</span> `attribute of an eoc`, and a <span class="underline">sequence of encounters</span> `attribute of an eoc` between the health care professional and the patient.
    -   **Knowledge:** date of creation and sequence of encounters with patient are attributes of a eoc
    -   **Know-what:** it&rsquo;s a fact
7.  Each encounter has a <span class="underline">date</span> a <span class="underline">reference to the health care provider</span> and a <span class="underline">set of treatments</span> `attributes of an encounter`.
    -   **Knowledge:** date, reference to health care provider, set of treatments are attributes of an encounter
    -   **Know-what:** it&rsquo;s a fact
8.  A treatment is composed of a set of findings `part of treatment` which are <span class="underline">textual</span> `type of` descriptions of the patient signs and symptoms (for example, <span class="underline">fever</span>, <span class="underline">high blood pressure</span>, <span class="underline">breast pain</span>, &#x2026;).
    -   **Knowledge:** treatment has a set of findings
    -   **Knowledge:** set of findings collects textual descriptions of signs and symptoms
    -   **Knowledge:** fever, high blood pressure, breast pain are symptoms
    -   **Know-what:** its&rsquo; a fact
9.  A treatment can have attached a <span class="underline">disease or set of diseases</span> `attribute of a treatment` that the patient is treated of, and a set of <span class="underline">medical actions</span> `attribute of a treatment` that can be of the sort: <span class="underline">pharmacological</span>, <span class="underline">test order</span>, <span class="underline">visit</span> (to provider such as a specialist), or <span class="underline">recommendation</span>.
    -   **Knowledge:** treatment may have a set of diseases that the patient is treated of
    -   **Knowledge:** treatment may have a set of medical actions
    -   **Knowledge:** medical action can be pharmacological, test order, visit (to a specialist), or recommendation.
    -   **Know-what:** it&rsquo;s a fact
