exercises.org
** 2d and 3d

 1) A chair is a raised surface used to sit on, commonly for use by _one_ ~number of~ person.
    + Knowledge :: chair is a raised surface used to sit on
    + Knowledge :: chair is commonly used by one person at a time
    + Know-what :: it's a fact
 2) Chairs are most often supported by _four_ ~number of~ legs and have a back; however, a chair can have _three_ ~number of~ legs or could have a different shape.
    + Knowledge :: chair is often supported by four legs and have a back
    + Knowledge :: chair can vary in shape and number of legs
    + Know-what :: it's a fact
 3) A chair without a back or arm rests is a _stool_ ~type of chair~, or when raised up, a _bar stool_ ~type of chair~.
    + Knowledge :: stool is a chair without a back
    + Knowledge :: bar stool is a raised up stool
    + Know-what :: it's a fact
 4) A chair with arms is an _armchair_ ~type of chair~ and with folding action and inclining footrest, a recliner.
    + Knowledge :: amrchair is a chair with arms, folding action, inclining footrest, recliner
    + Know-what :: it's a fact
 5) A permanently fixed chair in a train or theater is a _seat_ ~type of chair~ or, in an airplane, _airline seat_ ~type of chair~; when riding, it is a _saddle_ ~type of chair~ and _bicycle saddle_ ~type of chair~, and for an automobile, a _car seat_ ~type of chair~ or _infant car seat_ ~type of chair~.
    + Knowledge :: seat is a permanently fixed chair
    + Knowledge :: airline seat is a seat in an airplane
    + Knowledge :: saddle is a seat used to ride
    + Knowledge :: bicycle saddle is a saddle for a bike
    + Knowledge :: car seat is a seat in a car
    + Knowledge :: infant car sear is a seat in a car
    + Knowledge-what :: it's a fact, describing specific nomenclature for different scenarios
    + Knowledge-how :: it's a rule, describing the underlying logic naming logic for some of the scenarios
 6) With wheels it is a _wheelchair_ ~type of chair~ and when hung from above, a _swing_ ~type of chair~.
    + Knowledge :: wheelchair is a chair with wheels
    + Knowledge :: swing is a hung chair
    + Know-what :: it's a fact

