exercises.html

<div id="outline-container-org7647b4d" class="outline-3">
<h3 id="org7647b4d"><span class="section-number-3">1.4</span> 2d and 3d</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>A chair is a raised surface used to sit on, commonly for use by <span class="underline">one</span> <code>number of</code> person.
<dl class="org-dl">
<dt>Knowledge</dt><dd>chair is a raised surface used to sit on</dd>
<dt>Knowledge</dt><dd>chair is commonly used by one person at a time</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Chairs are most often supported by <span class="underline">four</span> <code>number of</code> legs and have a back; however, a chair can have <span class="underline">three</span> <code>number of</code> legs or could have a different shape.
<dl class="org-dl">
<dt>Knowledge</dt><dd>chair is often supported by four legs and have a back</dd>
<dt>Knowledge</dt><dd>chair can vary in shape and number of legs</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>A chair without a back or arm rests is a <span class="underline">stool</span> <code>type of chair</code>, or when raised up, a <span class="underline">bar stool</span> <code>type of chair</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>stool is a chair without a back</dd>
<dt>Knowledge</dt><dd>bar stool is a raised up stool</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>A chair with arms is an <span class="underline">armchair</span> <code>type of chair</code> and with folding action and inclining footrest, a recliner.
<dl class="org-dl">
<dt>Knowledge</dt><dd>amrchair is a chair with arms, folding action, inclining footrest, recliner</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>A permanently fixed chair in a train or theater is a <span class="underline">seat</span> <code>type of chair</code> or, in an airplane, <span class="underline">airline seat</span> <code>type of chair</code>; when riding, it is a <span class="underline">saddle</span> <code>type of chair</code> and <span class="underline">bicycle saddle</span> <code>type of chair</code>, and for an automobile, a <span class="underline">car seat</span> <code>type of chair</code> or <span class="underline">infant car seat</span> <code>type of chair</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>seat is a permanently fixed chair</dd>
<dt>Knowledge</dt><dd>airline seat is a seat in an airplane</dd>
<dt>Knowledge</dt><dd>saddle is a seat used to ride</dd>
<dt>Knowledge</dt><dd>bicycle saddle is a saddle for a bike</dd>
<dt>Knowledge</dt><dd>car seat is a seat in a car</dd>
<dt>Knowledge</dt><dd>infant car sear is a seat in a car</dd>
<dt>Knowledge-what</dt><dd>it&rsquo;s a fact, describing specific nomenclature for different scenarios</dd>
<dt>Knowledge-how</dt><dd>it&rsquo;s a rule, describing the underlying logic naming logic for some of the scenarios</dd>
</dl></li>
<li>With wheels it is a <span class="underline">wheelchair</span> <code>type of chair</code> and when hung from above, a <span class="underline">swing</span> <code>type of chair</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>wheelchair is a chair with wheels</dd>
<dt>Knowledge</dt><dd>swing is a hung chair</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
</ol>
</div>
</div>
