exercises.tex

\subsection{2d and 3d}
\label{sec:org307b2b9}

\begin{enumerate}
\item A chair is a raised surface used to sit on, commonly for use by \uline{one} \texttt{number of} person.
\begin{description}
\item[{Knowledge}] chair is a raised surface used to sit on
\item[{Knowledge}] chair is commonly used by one person at a time
\item[{Know-what}] it's a fact
\end{description}
\item Chairs are most often supported by \uline{four} \texttt{number of} legs and have a back; however, a chair can have \uline{three} \texttt{number of} legs or could have a different shape.
\begin{description}
\item[{Knowledge}] chair is often supported by four legs and have a back
\item[{Knowledge}] chair can vary in shape and number of legs
\item[{Know-what}] it's a fact
\end{description}
\item A chair without a back or arm rests is a \uline{stool} \texttt{type of chair}, or when raised up, a \uline{bar stool} \texttt{type of chair}.
\begin{description}
\item[{Knowledge}] stool is a chair without a back
\item[{Knowledge}] bar stool is a raised up stool
\item[{Know-what}] it's a fact
\end{description}
\item A chair with arms is an \uline{armchair} \texttt{type of chair} and with folding action and inclining footrest, a recliner.
\begin{description}
\item[{Knowledge}] amrchair is a chair with arms, folding action, inclining footrest, recliner
\item[{Know-what}] it's a fact
\end{description}
\item A permanently fixed chair in a train or theater is a \uline{seat} \texttt{type of chair} or, in an airplane, \uline{airline seat} \texttt{type of chair}; when riding, it is a \uline{saddle} \texttt{type of chair} and \uline{bicycle saddle} \texttt{type of chair}, and for an automobile, a \uline{car seat} \texttt{type of chair} or \uline{infant car seat} \texttt{type of chair}.
\begin{description}
\item[{Knowledge}] seat is a permanently fixed chair
\item[{Knowledge}] airline seat is a seat in an airplane
\item[{Knowledge}] saddle is a seat used to ride
\item[{Knowledge}] bicycle saddle is a saddle for a bike
\item[{Knowledge}] car seat is a seat in a car
\item[{Knowledge}] infant car sear is a seat in a car
\item[{Knowledge-what}] it's a fact, describing specific nomenclature for different scenarios
\item[{Knowledge-how}] it's a rule, describing the underlying logic naming logic for some of the scenarios
\end{description}
\item With wheels it is a \uline{wheelchair} \texttt{type of chair} and when hung from above, a \uline{swing} \texttt{type of chair}.
\begin{description}
\item[{Knowledge}] wheelchair is a chair with wheels
\item[{Knowledge}] swing is a hung chair
\item[{Know-what}] it's a fact
\end{description}
\end{enumerate}
