exercises.md


<a id="org2d7fd27"></a>

## 2d and 3d

1.  A chair is a raised surface used to sit on, commonly for use by <span class="underline">one</span> `number of` person.
    -   **Knowledge:** chair is a raised surface used to sit on
    -   **Knowledge:** chair is commonly used by one person at a time
    -   **Know-what:** it&rsquo;s a fact
2.  Chairs are most often supported by <span class="underline">four</span> `number of` legs and have a back; however, a chair can have <span class="underline">three</span> `number of` legs or could have a different shape.
    -   **Knowledge:** chair is often supported by four legs and have a back
    -   **Knowledge:** chair can vary in shape and number of legs
    -   **Know-what:** it&rsquo;s a fact
3.  A chair without a back or arm rests is a <span class="underline">stool</span> `type of chair`, or when raised up, a <span class="underline">bar stool</span> `type of chair`.
    -   **Knowledge:** stool is a chair without a back
    -   **Knowledge:** bar stool is a raised up stool
    -   **Know-what:** it&rsquo;s a fact
4.  A chair with arms is an <span class="underline">armchair</span> `type of chair` and with folding action and inclining footrest, a recliner.
    -   **Knowledge:** amrchair is a chair with arms, folding action, inclining footrest, recliner
    -   **Know-what:** it&rsquo;s a fact
5.  A permanently fixed chair in a train or theater is a <span class="underline">seat</span> `type of chair` or, in an airplane, <span class="underline">airline seat</span> `type of chair`; when riding, it is a <span class="underline">saddle</span> `type of chair` and <span class="underline">bicycle saddle</span> `type of chair`, and for an automobile, a <span class="underline">car seat</span> `type of chair` or <span class="underline">infant car seat</span> `type of chair`.
    -   **Knowledge:** seat is a permanently fixed chair
    -   **Knowledge:** airline seat is a seat in an airplane
    -   **Knowledge:** saddle is a seat used to ride
    -   **Knowledge:** bicycle saddle is a saddle for a bike
    -   **Knowledge:** car seat is a seat in a car
    -   **Knowledge:** infant car sear is a seat in a car
    -   **Knowledge-what:** it&rsquo;s a fact, describing specific nomenclature for different scenarios
    -   **Knowledge-how:** it&rsquo;s a rule, describing the underlying logic naming logic for some of the scenarios
6.  With wheels it is a <span class="underline">wheelchair</span> `type of chair` and when hung from above, a <span class="underline">swing</span> `type of chair`.
    -   **Knowledge:** wheelchair is a chair with wheels
    -   **Knowledge:** swing is a hung chair
    -   **Know-what:** it&rsquo;s a fact
