exercises.org
** 2e and 3e

1) The Nobel Prizes are _annual_ ~frequency~ _international_ ~scope~ awards bestowed by _Scandinavian committees_ ~awarder~ in recognition of _cultural and scientific advances_ ~type of achievement~.
   + Knowledge :: nobel prizes are annual
   + Knowledge :: nobel prizes are international
   + Knowledge :: nobel prizes are awarded by Scandinavian commitees
   + Knowledge :: nobel prizes are awarded for cultural and scientific advances
   + Know-what :: it's a fact
2) The will of the _Swedish_ ~nationality~ _chemist_ ~qualification~ _Alfred Nobel_ ~name~, the _inventor of dynamite_ ~achievement~, established the prizes in _1895_ ~year~.
   + Knowledge :: Alfred Nobel is swedish
   + Knowledge :: Alfred Nobel is a chemist
   + Knowledge :: Alfred Nobel is the inventor of dynamite
   + Knowledge :: Alfred Nobel established the nobel prizes in 1895
   + Know-what :: it's a fact
3) The _2_ ~number of~ prizes in _Physics_, _Chemistry_, _Physiology or Medicine_, _Literature_, and _Peace_ were first awarded in _1901_.
   + Knowledge :: Physics, Chemistry, Physiology or Medicine, Literature, and Peace are nobel prizes
   + Knowledge :: Physics had 2 nobel prizes in 1901
   + Know-fact :: it's a fact
4) The Peace Prize is awarded in _Oslo, Norway_ ~location~, while the other prizes are awarded in _Stockholm, Sweden_ ~location~.
   + Knowledge :: Peace prize is awarded in Oslo, Norway
   + Knowledge :: Physics, Chemistry, Physiology or Medicine, Literature are awarded in Stockholm, Sweden
   + Know-what :: it's a fact
5) Each Nobel Prize is regarded as the _most prestigious_ ~level of recognition of~ award  in its field.
   + Knowledge :: nobel prizes are the most prestigious award in their field
   + Know-what :: it's a fact
6) In 1968, _Sveriges Riksbank_ ~name~ instituted an award that is often associated with the Nobel prizes, the _Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel_ ~name of the prize~.
   + Knowledge :: Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is an award associated with the Nobel prizes
   + Knowledge :: Sveriges Riksbank instituted the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel
   + Know-what :: it's a fact
7) The first such prize was awarded in _1969_ ~date of awarding~.
   + Knowledge :: Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel was awarded for the first time in 1969
   + Know-what :: it's a fact
8) Although it is _not an official Nobel Prize_ ~relationship with Nobel prize~,its _announcements and presentations_ ~events shared with Nobel prizes~ are made along with the other prizes.
   + Knowledge :: Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is not an official nobel prize
   + Knowledge :: Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel shares announcements and presentations with nobel prizes
   + Know-what :: it's a fact
9) _The Royal Swedish Academy of Sciences_ ~awarder name~ awards the _Nobel Prize in Physics_, the _Nobel Prize in Chemistry_, and the _Nobel Memorial Prize in Economic Sciences_ ~names of prizes~
   + Knowledge :: The Royal Swedish Academy of Sciences awards Nobel Prize in Physics, the Nobel Prize in Chemistry, and the Nobel Memorial Prize in Economic Sciences
   + Know-what :: it's a fact
10) _The Nobel Assembly at Karolinska Institutet_ ~awarder name~ awards the _Nobel Prize in Physiology or Medicine_ ~name of prize~.
    + Knowledge :: The Nobel Assembly at Karolinska Institutet awards the Nobel Prize in Physiology or Medicine.
    + Know-what :: it's a fact
11) _The Swedish Academy_ ~awarder name~ grants the _Nobel Prize in Literature_ ~name of prize~
    + Knowledge :: The Swedish Academy grants the Nobel Prize in Literature
12) The _Nobel Peace Prize_ ~name of prize~ is not awarded by a Swedish organization but by the _Norwegian Nobel Committee_ ~awarder~.
    + Knowledge :: The Nobel Peace Prize is awarded by the Norwegian Nobel Committee
    + Know-what :: it's a fact
13) Each recipient, or laureate, receives a _gold medal_, a _diploma_, and a _sum of money_ ~prizes of the award~ which depends on the Nobel Foundation's income that year.
    + Knowledge :: the awarded of the nobel prize receives a gold medal, a diploma and a sum of money depending on the Nobel Foundation's income that year
    + Know-what :: it's a fact
14) In _2011_ ~year~, each prize was worth _€1.15 million_ ~prize value~.
    + Knowledge :: the value of each noble prize was €1.15 million in 2011
    + Know-what :: it's a fact

The whole text starting from sentence 9 and ending in sentence 12 may be also seen as a =Know-how= knowledge describing a rule deciciding who should be the awarder for a specific prize.

