exercises.html

<div id="outline-container-org3c41cc8" class="outline-3">
<h3 id="org3c41cc8"><span class="section-number-3">1.5</span> 2e and 3e</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>The Nobel Prizes are <span class="underline">annual</span> <code>frequency</code> <span class="underline">international</span> <code>scope</code> awards bestowed by <span class="underline">Scandinavian committees</span> <code>awarder</code> in recognition of <span class="underline">cultural and scientific advances</span> <code>type of achievement</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>nobel prizes are annual</dd>
<dt>Knowledge</dt><dd>nobel prizes are international</dd>
<dt>Knowledge</dt><dd>nobel prizes are awarded by Scandinavian commitees</dd>
<dt>Knowledge</dt><dd>nobel prizes are awarded for cultural and scientific advances</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>The will of the <span class="underline">Swedish</span> <code>nationality</code> <span class="underline">chemist</span> <code>qualification</code> <span class="underline">Alfred Nobel</span> <code>name</code>, the <span class="underline">inventor of dynamite</span> <code>achievement</code>, established the prizes in <span class="underline">1895</span> <code>year</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Alfred Nobel is swedish</dd>
<dt>Knowledge</dt><dd>Alfred Nobel is a chemist</dd>
<dt>Knowledge</dt><dd>Alfred Nobel is the inventor of dynamite</dd>
<dt>Knowledge</dt><dd>Alfred Nobel established the nobel prizes in 1895</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>The <span class="underline">2</span> <code>number of</code> prizes in <span class="underline">Physics</span>, <span class="underline">Chemistry</span>, <span class="underline">Physiology or Medicine</span>, <span class="underline">Literature</span>, and <span class="underline">Peace</span> were first awarded in <span class="underline">1901</span>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Physics, Chemistry, Physiology or Medicine, Literature, and Peace are nobel prizes</dd>
<dt>Knowledge</dt><dd>Physics had 2 nobel prizes in 1901</dd>
<dt>Know-fact</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>The Peace Prize is awarded in <span class="underline">Oslo, Norway</span> <code>location</code>, while the other prizes are awarded in <span class="underline">Stockholm, Sweden</span> <code>location</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Peace prize is awarded in Oslo, Norway</dd>
<dt>Knowledge</dt><dd>Physics, Chemistry, Physiology or Medicine, Literature are awarded in Stockholm, Sweden</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Each Nobel Prize is regarded as the <span class="underline">most prestigious</span> <code>level of recognition of</code> award  in its field.
<dl class="org-dl">
<dt>Knowledge</dt><dd>nobel prizes are the most prestigious award in their field</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>In 1968, <span class="underline">Sveriges Riksbank</span> <code>name</code> instituted an award that is often associated with the Nobel prizes, the <span class="underline">Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel</span> <code>name of the prize</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is an award associated with the Nobel prizes</dd>
<dt>Knowledge</dt><dd>Sveriges Riksbank instituted the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>The first such prize was awarded in <span class="underline">1969</span> <code>date of awarding</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel was awarded for the first time in 1969</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Although it is <span class="underline">not an official Nobel Prize</span> <code>relationship with Nobel prize</code>,its <span class="underline">announcements and presentations</span> <code>events shared with Nobel prizes</code> are made along with the other prizes.
<dl class="org-dl">
<dt>Knowledge</dt><dd>Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is not an official nobel prize</dd>
<dt>Knowledge</dt><dd>Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel shares announcements and presentations with nobel prizes</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li><span class="underline">The Royal Swedish Academy of Sciences</span> <code>awarder name</code> awards the <span class="underline">Nobel Prize in Physics</span>, the <span class="underline">Nobel Prize in Chemistry</span>, and the <span class="underline">Nobel Memorial Prize in Economic Sciences</span> <code>names of prizes</code>
<dl class="org-dl">
<dt>Knowledge</dt><dd>The Royal Swedish Academy of Sciences awards Nobel Prize in Physics, the Nobel Prize in Chemistry, and the Nobel Memorial Prize in Economic Sciences</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li><span class="underline">The Nobel Assembly at Karolinska Institutet</span> <code>awarder name</code> awards the <span class="underline">Nobel Prize in Physiology or Medicine</span> <code>name of prize</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>The Nobel Assembly at Karolinska Institutet awards the Nobel Prize in Physiology or Medicine.</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li><span class="underline">The Swedish Academy</span> <code>awarder name</code> grants the <span class="underline">Nobel Prize in Literature</span> <code>name of prize</code>
<dl class="org-dl">
<dt>Knowledge</dt><dd>The Swedish Academy grants the Nobel Prize in Literature</dd>
</dl></li>
<li>The <span class="underline">Nobel Peace Prize</span> <code>name of prize</code> is not awarded by a Swedish organization but by the <span class="underline">Norwegian Nobel Committee</span> <code>awarder</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>The Nobel Peace Prize is awarded by the Norwegian Nobel Committee</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Each recipient, or laureate, receives a <span class="underline">gold medal</span>, a <span class="underline">diploma</span>, and a <span class="underline">sum of money</span> <code>prizes of the award</code> which depends on the Nobel Foundation&rsquo;s income that year.
<dl class="org-dl">
<dt>Knowledge</dt><dd>the awarded of the nobel prize receives a gold medal, a diploma and a sum of money depending on the Nobel Foundation&rsquo;s income that year</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>In <span class="underline">2011</span> <code>year</code>, each prize was worth <span class="underline">€1.15 million</span> <code>prize value</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>the value of each noble prize was €1.15 million in 2011</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
</ol>

<p>
The whole text starting from sentence 9 and ending in sentence 12 may be also seen as a <code>Know-how</code> knowledge describing a rule deciciding who should be the awarder for a specific prize.
</p>
</div>
</div>
