exercises.tex

\subsection{2e and 3e}
\label{sec:org28bc229}

\begin{enumerate}
\item The Nobel Prizes are \uline{annual} \texttt{frequency} \uline{international} \texttt{scope} awards bestowed by \uline{Scandinavian committees} \texttt{awarder} in recognition of \uline{cultural and scientific advances} \texttt{type of achievement}.
\begin{description}
\item[{Knowledge}] nobel prizes are annual
\item[{Knowledge}] nobel prizes are international
\item[{Knowledge}] nobel prizes are awarded by Scandinavian commitees
\item[{Knowledge}] nobel prizes are awarded for cultural and scientific advances
\item[{Know-what}] it's a fact
\end{description}
\item The will of the \uline{Swedish} \texttt{nationality} \uline{chemist} \texttt{qualification} \uline{Alfred Nobel} \texttt{name}, the \uline{inventor of dynamite} \texttt{achievement}, established the prizes in \uline{1895} \texttt{year}.
\begin{description}
\item[{Knowledge}] Alfred Nobel is swedish
\item[{Knowledge}] Alfred Nobel is a chemist
\item[{Knowledge}] Alfred Nobel is the inventor of dynamite
\item[{Knowledge}] Alfred Nobel established the nobel prizes in 1895
\item[{Know-what}] it's a fact
\end{description}
\item The \uline{2} \texttt{number of} prizes in \uline{Physics}, \uline{Chemistry}, \uline{Physiology or Medicine}, \uline{Literature}, and \uline{Peace} were first awarded in \uline{1901}.
\begin{description}
\item[{Knowledge}] Physics, Chemistry, Physiology or Medicine, Literature, and Peace are nobel prizes
\item[{Knowledge}] Physics had 2 nobel prizes in 1901
\item[{Know-fact}] it's a fact
\end{description}
\item The Peace Prize is awarded in \uline{Oslo, Norway} \texttt{location}, while the other prizes are awarded in \uline{Stockholm, Sweden} \texttt{location}.
\begin{description}
\item[{Knowledge}] Peace prize is awarded in Oslo, Norway
\item[{Knowledge}] Physics, Chemistry, Physiology or Medicine, Literature are awarded in Stockholm, Sweden
\item[{Know-what}] it's a fact
\end{description}
\item Each Nobel Prize is regarded as the \uline{most prestigious} \texttt{level of recognition of} award  in its field.
\begin{description}
\item[{Knowledge}] nobel prizes are the most prestigious award in their field
\item[{Know-what}] it's a fact
\end{description}
\item In 1968, \uline{Sveriges Riksbank} \texttt{name} instituted an award that is often associated with the Nobel prizes, the \uline{Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel} \texttt{name of the prize}.
\begin{description}
\item[{Knowledge}] Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is an award associated with the Nobel prizes
\item[{Knowledge}] Sveriges Riksbank instituted the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel
\item[{Know-what}] it's a fact
\end{description}
\item The first such prize was awarded in \uline{1969} \texttt{date of awarding}.
\begin{description}
\item[{Knowledge}] Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel was awarded for the first time in 1969
\item[{Know-what}] it's a fact
\end{description}
\item Although it is \uline{not an official Nobel Prize} \texttt{relationship with Nobel prize},its \uline{announcements and \_presentations} \texttt{events shared with Nobel prizes} are made along with the other prizes.
\begin{description}
\item[{Knowledge}] Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is not an official nobel prize
\item[{Knowledge}] Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel shares announcements and presentations with nobel prizes
\item[{Know-what}] it's a fact
\end{description}
\item \uline{The Royal Swedish Academy of Sciences} \texttt{awarder name} awards the \uline{Nobel Prize in Physics}, the \uline{Nobel Prize in Chemistry}, and the \uline{Nobel Memorial Prize in Economic Sciences} \texttt{names of prizes}
\begin{description}
\item[{Knowledge}] The Royal Swedish Academy of Sciences awards Nobel Prize in Physics, the Nobel Prize in Chemistry, and the Nobel Memorial Prize in Economic Sciences
\item[{Know-what}] it's a fact
\end{description}
\item \uline{The Nobel Assembly at Karolinska Institutet} \texttt{awarder name} awards the \uline{Nobel Prize in Physiology or Medicine} \texttt{name of prize}.
\begin{description}
\item[{Knowledge}] The Nobel Assembly at Karolinska Institutet awards the Nobel Prize in Physiology or Medicine.
\item[{Know-what}] it's a fact
\end{description}
\item \uline{The Swedish Academy} \texttt{awarder name} grants the \uline{Nobel Prize in Literature} \texttt{name of prize}
\begin{description}
\item[{Knowledge}] The Swedish Academy grants the Nobel Prize in Literature
\end{description}
\item The \uline{Nobel Peace Prize} \texttt{name of prize} is not awarded by a Swedish organization but by the \uline{Norwegian Nobel Committee} \texttt{awarder}.
\begin{description}
\item[{Knowledge}] The Nobel Peace Prize is awarded by the Norwegian Nobel Committee
\item[{Know-what}] it's a fact
\end{description}
\item Each recipient, or laureate, receives a \uline{gold medal}, a \uline{diploma}, and a \uline{sum of money} \texttt{prizes of the award} which depends on the Nobel Foundation's income that year.
\begin{description}
\item[{Knowledge}] the awarded of the nobel prize receives a gold medal, a diploma and a sum of money depending on the Nobel Foundation's income that year
\item[{Know-what}] it's a fact
\end{description}
\item In \uline{2011} \texttt{year}, each prize was worth \uline{€1.15 million} \texttt{prize value}.
\begin{description}
\item[{Knowledge}] the value of each noble prize was €1.15 million in 2011
\item[{Know-what}] it's a fact
\end{description}
\end{enumerate}

The whole text starting from sentence 9 and ending in sentence 12 may be also seen as a \texttt{Know-how} knowledge describing a rule deciciding who should be the awarder for a specific prize.
