exercises.md


<a id="org2dd5cff"></a>

## 2e and 3e

1.  The Nobel Prizes are <span class="underline">annual</span> `frequency` <span class="underline">international</span> `scope` awards bestowed by <span class="underline">Scandinavian committees</span> `awarder` in recognition of <span class="underline">cultural and scientific advances</span> `type of achievement`.
    -   **Knowledge:** nobel prizes are annual
    -   **Knowledge:** nobel prizes are international
    -   **Knowledge:** nobel prizes are awarded by Scandinavian commitees
    -   **Knowledge:** nobel prizes are awarded for cultural and scientific advances
    -   **Know-what:** it&rsquo;s a fact
2.  The will of the <span class="underline">Swedish</span> `nationality` <span class="underline">chemist</span> `qualification` <span class="underline">Alfred Nobel</span> `name`, the <span class="underline">inventor of dynamite</span> `achievement`, established the prizes in <span class="underline">1895</span> `year`.
    -   **Knowledge:** Alfred Nobel is swedish
    -   **Knowledge:** Alfred Nobel is a chemist
    -   **Knowledge:** Alfred Nobel is the inventor of dynamite
    -   **Knowledge:** Alfred Nobel established the nobel prizes in 1895
    -   **Know-what:** it&rsquo;s a fact
3.  The <span class="underline">2</span> `number of` prizes in <span class="underline">Physics</span>, <span class="underline">Chemistry</span>, <span class="underline">Physiology or Medicine</span>, <span class="underline">Literature</span>, and <span class="underline">Peace</span> were first awarded in <span class="underline">1901</span>.
    -   **Knowledge:** Physics, Chemistry, Physiology or Medicine, Literature, and Peace are nobel prizes
    -   **Knowledge:** Physics had 2 nobel prizes in 1901
    -   **Know-fact:** it&rsquo;s a fact
4.  The Peace Prize is awarded in <span class="underline">Oslo, Norway</span> `location`, while the other prizes are awarded in <span class="underline">Stockholm, Sweden</span> `location`.
    -   **Knowledge:** Peace prize is awarded in Oslo, Norway
    -   **Knowledge:** Physics, Chemistry, Physiology or Medicine, Literature are awarded in Stockholm, Sweden
    -   **Know-what:** it&rsquo;s a fact
5.  Each Nobel Prize is regarded as the <span class="underline">most prestigious</span> `level of recognition of` award  in its field.
    -   **Knowledge:** nobel prizes are the most prestigious award in their field
    -   **Know-what:** it&rsquo;s a fact
6.  In 1968, <span class="underline">Sveriges Riksbank</span> `name` instituted an award that is often associated with the Nobel prizes, the <span class="underline">Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel</span> `name of the prize`.
    -   **Knowledge:** Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is an award associated with the Nobel prizes
    -   **Knowledge:** Sveriges Riksbank instituted the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel
    -   **Know-what:** it&rsquo;s a fact
7.  The first such prize was awarded in <span class="underline">1969</span> `date of awarding`.
    -   **Knowledge:** Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel was awarded for the first time in 1969
    -   **Know-what:** it&rsquo;s a fact
8.  Although it is <span class="underline">not an official Nobel Prize</span> `relationship with Nobel prize`,its <span class="underline">announcements and presentations</span> `events shared with Nobel prizes` are made along with the other prizes.
    -   **Knowledge:** Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel is not an official nobel prize
    -   **Knowledge:** Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel shares announcements and presentations with nobel prizes
    -   **Know-what:** it&rsquo;s a fact
9.  <span class="underline">The Royal Swedish Academy of Sciences</span> `awarder name` awards the <span class="underline">Nobel Prize in Physics</span>, the <span class="underline">Nobel Prize in Chemistry</span>, and the <span class="underline">Nobel Memorial Prize in Economic Sciences</span> `names of prizes`
    -   **Knowledge:** The Royal Swedish Academy of Sciences awards Nobel Prize in Physics, the Nobel Prize in Chemistry, and the Nobel Memorial Prize in Economic Sciences
    -   **Know-what:** it&rsquo;s a fact
10. <span class="underline">The Nobel Assembly at Karolinska Institutet</span> `awarder name` awards the <span class="underline">Nobel Prize in Physiology or Medicine</span> `name of prize`.
    -   **Knowledge:** The Nobel Assembly at Karolinska Institutet awards the Nobel Prize in Physiology or Medicine.
    -   **Know-what:** it&rsquo;s a fact
11. <span class="underline">The Swedish Academy</span> `awarder name` grants the <span class="underline">Nobel Prize in Literature</span> `name of prize`
    -   **Knowledge:** The Swedish Academy grants the Nobel Prize in Literature
12. The <span class="underline">Nobel Peace Prize</span> `name of prize` is not awarded by a Swedish organization but by the <span class="underline">Norwegian Nobel Committee</span> `awarder`.
    -   **Knowledge:** The Nobel Peace Prize is awarded by the Norwegian Nobel Committee
    -   **Know-what:** it&rsquo;s a fact
13. Each recipient, or laureate, receives a <span class="underline">gold medal</span>, a <span class="underline">diploma</span>, and a <span class="underline">sum of money</span> `prizes of the award` which depends on the Nobel Foundation&rsquo;s income that year.
    -   **Knowledge:** the awarded of the nobel prize receives a gold medal, a diploma and a sum of money depending on the Nobel Foundation&rsquo;s income that year
    -   **Know-what:** it&rsquo;s a fact
14. In <span class="underline">2011</span> `year`, each prize was worth <span class="underline">€1.15 million</span> `prize value`.
    -   **Knowledge:** the value of each noble prize was €1.15 million in 2011
    -   **Know-what:** it&rsquo;s a fact

The whole text starting from sentence 9 and ending in sentence 12 may be also seen as a `Know-how` knowledge describing a rule deciciding who should be the awarder for a specific prize.
