exercises.org
** 2f and 3f
 1) A _stock market_ ~type of market~ is a _public market_ ~type of market~ for the trading of company stock (shares) and derivatives at an agreed price.
    + Knowledge :: stock market is a public market
    + Knowledge :: company stock (shares) and derivatives are traded in a stock market
    + Know-what :: it's a fact
 2) A _share_ ~type of unit~ is a unit of account for various financial instruments including stocks, and investments.
    + Knowledge :: a share is a unit of account used for financial instruments and investments
    + Knowledge :: a stock is a financial instrument
    + Know-what :: it's a fact
 3) On the other hand, a _derivative_ ~type of financial instrument~ is a financial instrument that has a value, based on the expected future price movements of the asset to which it is linked.
    + Knowledge :: a derivative is a financial instrument
    + Knowledge :: the value of a derivative is based on the expected future price movements of the asset to which it is linked
    + Know-what :: it's a fact

The whole text starting from sentence 2 and ending in sentence 3 may be also seen as a =Know-how= knowledge describing a rule to distinguish stock and derivatives.

** 2g and 3g

 1) Engines can be classified into _internal_ ~type of combustion~ and _external_ ~type of combustion~ _combustion_ ~type of engine~ engines.
    + Knowledge :: combustion can be internal or external
    + Knowledge :: combustion engines can be classified on their type of combustion
    + Know-what :: it's a fact
 2) _Internal combustion engines_ ( _ICE_ ) ~type of engine~ are engines in which the combustion of a fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.
    + Knowledge :: in ICE the combustion of fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.
    + Know-what :: it's a fact
 3) On the contrary, in _external combustion engines_ ( _ECE_ ) ~type of engine~, such as _steam engines_ or _Stirling engines_ ~types of engines~, the energy is delivered to a working fluid (substance) different of a combustion product.
    + Knowledge :: in ECE the energy is delivered to a working fluid (substance) different of a combustion product
    + Knowledge :: steam engines are ECE
    + Knowledge :: Stirling engines are ECE
    + Know-what :: it's a fact
 4) Working fluids can be _air_, _hot water_, or _pressurized water_ ~types of working fluids~.
    + Knowledge :: air, hot water and pressurized water can be working fluids

The whole text starting from sentence 1 and ending in sentence 4 may be also seen as a =Know-how= knowledge describing a rule to distinguish between different kind of engines.

