exercises.html

<div id="outline-container-orgd5106e5" class="outline-3">
<h3 id="orgd5106e5"><span class="section-number-3">1.6</span> 2f and 3f</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>A <span class="underline">stock market</span> <code>type of market</code> is a <span class="underline">public market</span> <code>type of market</code> for the trading of company stock (shares) and derivatives at an agreed price.
<dl class="org-dl">
<dt>Knowledge</dt><dd>stock market is a public market</dd>
<dt>Knowledge</dt><dd>company stock (shares) and derivatives are traded in a stock market</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>A <span class="underline">share</span> <code>type of unit</code> is a unit of account for various financial instruments including stocks, and investments.
<dl class="org-dl">
<dt>Knowledge</dt><dd>a share is a unit of account used for financial instruments and investments</dd>
<dt>Knowledge</dt><dd>a stock is a financial instrument</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>On the other hand, a <span class="underline">derivative</span> <code>type of financial instrument</code> is a financial instrument that has a value, based on the expected future price movements of the asset to which it is linked.
<dl class="org-dl">
<dt>Knowledge</dt><dd>a derivative is a financial instrument</dd>
<dt>Knowledge</dt><dd>the value of a derivative is based on the expected future price movements of the asset to which it is linked</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
</ol>

<p>
The whole text starting from sentence 2 and ending in sentence 3 may be also seen as a <code>Know-how</code> knowledge describing a rule to distinguish stock and derivatives.
</p>
</div>
</div>

<div id="outline-container-org212ecaa" class="outline-3">
<h3 id="org212ecaa"><span class="section-number-3">1.7</span> 2g and 3g</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>Engines can be classified into <span class="underline">internal</span> <code>type of combustion</code> and <span class="underline">external</span> <code>type of combustion</code> <span class="underline">combustion</span> <code>type of engine</code> engines.
<dl class="org-dl">
<dt>Knowledge</dt><dd>combustion can be internal or external</dd>
<dt>Knowledge</dt><dd>combustion engines can be classified on their type of combustion</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li><span class="underline">Internal combustion engines</span> ( <span class="underline">ICE</span> ) <code>type of engine</code> are engines in which the combustion of a fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.
<dl class="org-dl">
<dt>Knowledge</dt><dd>in ICE the combustion of fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>On the contrary, in <span class="underline">external combustion engines</span> ( <span class="underline">ECE</span> ) <code>type of engine</code>, such as <span class="underline">steam engines</span> or <span class="underline">Stirling engines</span> <code>types of engines</code>, the energy is delivered to a working fluid (substance) different of a combustion product.
<dl class="org-dl">
<dt>Knowledge</dt><dd>in ECE the energy is delivered to a working fluid (substance) different of a combustion product</dd>
<dt>Knowledge</dt><dd>steam engines are ECE</dd>
<dt>Knowledge</dt><dd>Stirling engines are ECE</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Working fluids can be <span class="underline">air</span>, <span class="underline">hot water</span>, or <span class="underline">pressurized water</span> <code>types of working fluids</code>.
<dl class="org-dl">
<dt>Knowledge</dt><dd>air, hot water and pressurized water can be working fluids</dd>
</dl></li>
</ol>

<p>
The whole text starting from sentence 1 and ending in sentence 4 may be also seen as a <code>Know-how</code> knowledge describing a rule to distinguish between different kind of engines.
</p>
</div>
</div>
