exercises.tex

\subsection{2f and 3f}
\label{sec:org836c9b4}
\begin{enumerate}
\item A \uline{stock market} \texttt{type of market} is a \uline{public market} \texttt{type of market} for the trading of company stock (shares) and derivatives at an agreed price.
\begin{description}
\item[{Knowledge}] stock market is a public market
\item[{Knowledge}] company stock (shares) and derivatives are traded in a stock market
\item[{Know-what}] it's a fact
\end{description}
\item A \uline{share} \texttt{type of unit} is a unit of account for various financial instruments including stocks, and investments.
\begin{description}
\item[{Knowledge}] a share is a unit of account used for financial instruments and investments
\item[{Knowledge}] a stock is a financial instrument
\item[{Know-what}] it's a fact
\end{description}
\item On the other hand, a \uline{derivative} \texttt{type of financial instrument} is a financial instrument that has a value, based on the expected future price movements of the asset to which it is linked.
\begin{description}
\item[{Knowledge}] a derivative is a financial instrument
\item[{Knowledge}] the value of a derivative is based on the expected future price movements of the asset to which it is linked
\item[{Know-what}] it's a fact
\end{description}
\end{enumerate}

The whole text starting from sentence 2 and ending in sentence 3 may be also seen as a \texttt{Know-how} knowledge describing a rule to distinguish stock and derivatives.

\subsection{2g and 3g}
\label{sec:org35537ed}

\begin{enumerate}
\item Engines can be classified into \uline{internal} \texttt{type of combustion} and \uline{external} \texttt{type of combustion} \uline{combustion} \texttt{type of engine} engines.
\begin{description}
\item[{Knowledge}] combustion can be internal or external
\item[{Knowledge}] combustion engines can be classified on their type of combustion
\item[{Know-what}] it's a fact
\end{description}
\item \uline{Internal combustion engines} ( \uline{ICE} ) \texttt{type of engine} are engines in which the combustion of a fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.
\begin{description}
\item[{Knowledge}] in ICE the combustion of fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.
\item[{Know-what}] it's a fact
\end{description}
\item On the contrary, in \uline{external combustion engines} ( \uline{ECE} ) \texttt{type of engine}, such as \uline{steam engines} or \uline{Stirling engines} \texttt{types of engines}, the energy is delivered to a working fluid (substance) different of a combustion product.
\begin{description}
\item[{Knowledge}] in ECE the energy is delivered to a working fluid (substance) different of a combustion product
\item[{Knowledge}] steam engines are ECE
\item[{Knowledge}] Stirling engines are ECE
\item[{Know-what}] it's a fact
\end{description}
\item Working fluids can be \uline{air}, \uline{hot water}, or \uline{pressurized water} \texttt{types of working fluids}.
\begin{description}
\item[{Knowledge}] air, hot water and pressurized water can be working fluids
\end{description}
\end{enumerate}

The whole text starting from sentence 1 and ending in sentence 4 may be also seen as a \texttt{Know-how} knowledge describing a rule to distinguish between different kind of engines.
