exercises.md


<a id="org9bf32bc"></a>

## 2f and 3f

1.  A <span class="underline">stock market</span> `type of market` is a <span class="underline">public market</span> `type of market` for the trading of company stock (shares) and derivatives at an agreed price.
    -   **Knowledge:** stock market is a public market
    -   **Knowledge:** company stock (shares) and derivatives are traded in a stock market
    -   **Know-what:** it&rsquo;s a fact
2.  A <span class="underline">share</span> `type of unit` is a unit of account for various financial instruments including stocks, and investments.
    -   **Knowledge:** a share is a unit of account used for financial instruments and investments
    -   **Knowledge:** a stock is a financial instrument
    -   **Know-what:** it&rsquo;s a fact
3.  On the other hand, a <span class="underline">derivative</span> `type of financial instrument` is a financial instrument that has a value, based on the expected future price movements of the asset to which it is linked.
    -   **Knowledge:** a derivative is a financial instrument
    -   **Knowledge:** the value of a derivative is based on the expected future price movements of the asset to which it is linked
    -   **Know-what:** it&rsquo;s a fact

The whole text starting from sentence 2 and ending in sentence 3 may be also seen as a `Know-how` knowledge describing a rule to distinguish stock and derivatives.


<a id="org8a85451"></a>

## 2g and 3g

1.  Engines can be classified into <span class="underline">internal</span> `type of combustion` and <span class="underline">external</span> `type of combustion` <span class="underline">combustion</span> `type of engine` engines.
    -   **Knowledge:** combustion can be internal or external
    -   **Knowledge:** combustion engines can be classified on their type of combustion
    -   **Know-what:** it&rsquo;s a fact
2.  <span class="underline">Internal combustion engines</span> ( <span class="underline">ICE</span> ) `type of engine` are engines in which the combustion of a fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.
    -   **Knowledge:** in ICE the combustion of fuel (substance) occurs with an oxidizer (substance) in a combustion chamber.
    -   **Know-what:** it&rsquo;s a fact
3.  On the contrary, in <span class="underline">external combustion engines</span> ( <span class="underline">ECE</span> ) `type of engine`, such as <span class="underline">steam engines</span> or <span class="underline">Stirling engines</span> `types of engines`, the energy is delivered to a working fluid (substance) different of a combustion product.
    -   **Knowledge:** in ECE the energy is delivered to a working fluid (substance) different of a combustion product
    -   **Knowledge:** steam engines are ECE
    -   **Knowledge:** Stirling engines are ECE
    -   **Know-what:** it&rsquo;s a fact
4.  Working fluids can be <span class="underline">air</span>, <span class="underline">hot water</span>, or <span class="underline">pressurized water</span> `types of working fluids`.
    -   **Knowledge:** air, hot water and pressurized water can be working fluids

The whole text starting from sentence 1 and ending in sentence 4 may be also seen as a `Know-how` knowledge describing a rule to distinguish between different kind of engines.
