exercises.org
** 2h and 3h
1) _Chronic disease_ ~name of~ treatment divides each disease in stages.
   + Knowledge :: chronic diseas treatment divides each disease in stages
   + Know-what :: it's a fact
2) Patients that have _one_ ~number of~ _chronic disease_ ~type of~ are classified in _one_ ~number of~ of these stages.
   + Knowledge :: a patient having a chronic diseases is classified in a disease's stage
   + Know-what :: it's a fact
3) _General_ ~type of~ practitioners base their decisions in the current stage of the patient and the time this patient has been in that stage.
   + Knowledge :: a practitioner needs current stage and its duration to make a decision on a patient
   + Know-what :: it's a fact
4) In general, a patient that is in a _mild-moderate dangerous_ ~type of~ stage ( _MDS_ ) ~type of~ is asked to modify his/her lifestyle ( _diet, salt intake reduction, moderate exercise_ ) ~types of~, if the patient has been in a MDS for a significant period, he/she is prescribed with _one_ ~number of~ drug to _minimal_ ~amount of~ dosage, while the patient is not improving the dosage is increased with fix increments.
   + Knowledge :: if patient is in MDS stage then ask to change lifestyle
   + Knowledge :: if patient is in MDS stage for a long time then prescribe minimal dose of a drug
   + Knowledge :: if patient is in MDS stage for a long time and he doesn't improve then increase dosage by fix increments
   + Know-how :: it's a rule, or better a procedure describing a sequence of steps dealing with multiple scenarios
5) If a _maximal_ ~amount of~ dosage is reached, then a second drug to _minimal_ ~amount of~ dosage is prescribed
   + Knowledge :: if dosage is maximal then prescribe second drug at minimal dosage
   + Know-how :: part of the previous procedure
6) Patients can reach treatments with _4_ ~number of~ drugs
   + Knowledge :: if dosage is maximal then prescribe second drug at minimal dosage
   + Know-how :: can be seen as a part of the previous procedure
   + Know-what :: or as a general fact
7) Patients that arrive in _highly dangerous_ ~type of~ stage ( _HDS_ ) ~type of~ are directly prescribed with _one_ ~number of~ drug and recommended lifestyle changes.
   - Know-what :: it's a rule
* TODO Knowledge Representation
* TODO Knowledge Engineering
* TODO Knowledge Representation in the Web
