exercises.html

<div id="outline-container-org9dfa5d8" class="outline-3">
<h3 id="org9dfa5d8"><span class="section-number-3">1.8</span> 2h and 3h</h3>
<div class="outline-text-3" id="text-1-8">
<ol class="org-ol">
<li><span class="underline">Chronic disease</span> <code>name of</code> treatment divides each disease in stages.
<dl class="org-dl">
<dt>Knowledge</dt><dd>chronic diseas treatment divides each disease in stages</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>Patients that have <span class="underline">one</span> <code>number of</code> <span class="underline">chronic disease</span> <code>type of</code> are classified in <span class="underline">one</span> <code>number of</code> of these stages.
<dl class="org-dl">
<dt>Knowledge</dt><dd>a patient having a chronic diseases is classified in a disease&rsquo;s stage</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li><span class="underline">General</span> <code>type of</code> practitioners base their decisions in the current stage of the patient and the time this patient has been in that stage.
<dl class="org-dl">
<dt>Knowledge</dt><dd>a practitioner needs current stage and its duration to make a decision on a patient</dd>
<dt>Know-what</dt><dd>it&rsquo;s a fact</dd>
</dl></li>
<li>In general, a patient that is in a <span class="underline">mild-moderate dangerous</span> <code>type of</code> stage ( <span class="underline">MDS</span> ) <code>type of</code> is asked to modify his/her lifestyle ( <span class="underline">diet, salt intake reduction, moderate exercise</span> ) <code>types of</code>, if the patient has been in a MDS for a significant period, he/she is prescribed with <span class="underline">one</span> <code>number of</code> drug to <span class="underline">minimal</span> <code>amount of</code> dosage, while the patient is not improving the dosage is increased with fix increments.
<dl class="org-dl">
<dt>Knowledge</dt><dd>if patient is in MDS stage then ask to change lifestyle</dd>
<dt>Knowledge</dt><dd>if patient is in MDS stage for a long time then prescribe minimal dose of a drug</dd>
<dt>Knowledge</dt><dd>if patient is in MDS stage for a long time and he doesn&rsquo;t improve then increase dosage by fix increments</dd>
<dt>Know-how</dt><dd>it&rsquo;s a rule, or better a procedure describing a sequence of steps dealing with multiple scenarios</dd>
</dl></li>
<li>If a <span class="underline">maximal</span> <code>amount of</code> dosage is reached, then a second drug to <span class="underline">minimal</span> <code>amount of</code> dosage is prescribed
<dl class="org-dl">
<dt>Knowledge</dt><dd>if dosage is maximal then prescribe second drug at minimal dosage</dd>
<dt>Know-how</dt><dd>part of the previous procedure</dd>
</dl></li>
<li>Patients can reach treatments with <span class="underline">4</span> <code>number of</code> drugs
<dl class="org-dl">
<dt>Knowledge</dt><dd>if dosage is maximal then prescribe second drug at minimal dosage</dd>
<dt>Know-how</dt><dd>can be seen as a part of the previous procedure</dd>
<dt>Know-what</dt><dd>or as a general fact</dd>
</dl></li>
<li>Patients that arrive in <span class="underline">highly dangerous</span> <code>type of</code> stage ( <span class="underline">HDS</span> ) <code>type of</code> are directly prescribed with <span class="underline">one</span> <code>number of</code> drug and recommended lifestyle changes.
<dl class="org-dl">
<dt>Know-what</dt><dd>it&rsquo;s a rule</dd>
</dl></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org34bed79" class="outline-2">
<h2 id="org34bed79"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Knowledge Representation</h2>
</div>
<div id="outline-container-org2609371" class="outline-2">
<h2 id="org2609371"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Knowledge Engineering</h2>
</div>
<div id="outline-container-orgbc5c9b7" class="outline-2">
<h2 id="orgbc5c9b7"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Knowledge Representation in the Web</h2>
</div>
</div>
</body>
</html>
