exercises.tex

\subsection{2h and 3h}
\label{sec:orgbe33df2}
\begin{enumerate}
\item \uline{Chronic disease} \texttt{name of} treatment divides each disease in stages.
\begin{description}
\item[{Knowledge}] chronic diseas treatment divides each disease in stages
\item[{Know-what}] it's a fact
\end{description}
\item Patients that have \uline{one} \texttt{number of} \uline{chronic disease} \texttt{type of} are classified in \uline{one} \texttt{number of} of these stages.
\begin{description}
\item[{Knowledge}] a patient having a chronic diseases is classified in a disease's stage
\item[{Know-what}] it's a fact
\end{description}
\item \uline{General} \texttt{type of} practitioners base their decisions in the current stage of the patient and the time this patient has been in that stage.
\begin{description}
\item[{Knowledge}] a practitioner needs current stage and its duration to make a decision on a patient
\item[{Know-what}] it's a fact
\end{description}
\item In general, a patient that is in a \uline{mild-moderate dangerous} \texttt{type of} stage (\textsubscript{MDS}\_) \texttt{type of} is asked to modify his/her lifestyle (\textsubscript{diet}, salt intake reduction, moderate exercise\_) \texttt{types of}, if the patient has been in a MDS for a significant period, he/she is prescribed with \uline{one} \texttt{number of} drug to \uline{minimal} \texttt{amount of} dosage, while the patient is not improving the dosage is increased with fix increments.
\begin{description}
\item[{Knowledge}] if patient is in MDS stage then ask to change lifestyle
\item[{Knowledge}] if patient is in MDS stage for a long time then prescribe minimal dose of a drug
\item[{Knowledge}] if patient is in MDS stage for a long time and he doesn't improve then increase dosage by fix increments
\item[{Know-how}] it's a rule, or better a procedure describing a sequence of steps dealing with multiple scenarios
\end{description}
\item If a \uline{maximal} \texttt{amount of} dosage is reached, then a second drug to \uline{minimal} \texttt{amount of} dosage is prescribed
\begin{description}
\item[{Knowledge}] if dosage is maximal then prescribe second drug at minimal dosage
\item[{Know-how}] part of the previous procedure
\end{description}
\item Patients can reach treatments with \uline{4} \texttt{number of} drugs
\begin{description}
\item[{Knowledge}] if dosage is maximal then prescribe second drug at minimal dosage
\item[{Know-how}] can be seen as a part of the previous procedure
\item[{Know-what}] or as a general fact
\end{description}
\item Patients that arrive in \uline{highly dangerous} \texttt{type of} stage (\textsubscript{HDS}\_) \texttt{type of} are directly prescribed with \uline{one} \texttt{number of} drug and recommended lifestyle changes.
\begin{description}
\item[{Know-what}] it's a rule
\end{description}
\end{enumerate}
\section{{\bfseries\sffamily TODO} Knowledge Representation}
\label{sec:org8eb6977}
\section{{\bfseries\sffamily TODO} Knowledge Engineering}
\label{sec:org2dd12f9}
\section{{\bfseries\sffamily TODO} Knowledge Representation in the Web}
\label{sec:orgd43ec9a}
\end{document}
