exercises.md


<a id="orgd53ef74"></a>

## 2h and 3h

1.  <span class="underline">Chronic disease</span> `name of` treatment divides each disease in stages.
    -   **Knowledge:** chronic diseas treatment divides each disease in stages
    -   **Know-what:** it&rsquo;s a fact
2.  Patients that have <span class="underline">one</span> `number of` <span class="underline">chronic disease</span> `type of` are classified in <span class="underline">one</span> `number of` of these stages.
    -   **Knowledge:** a patient having a chronic diseases is classified in a disease&rsquo;s stage
    -   **Know-what:** it&rsquo;s a fact
3.  <span class="underline">General</span> `type of` practitioners base their decisions in the current stage of the patient and the time this patient has been in that stage.
    -   **Knowledge:** a practitioner needs current stage and its duration to make a decision on a patient
    -   **Know-what:** it&rsquo;s a fact
4.  In general, a patient that is in a <span class="underline">mild-moderate dangerous</span> `type of` stage ( <span class="underline">MDS</span> ) `type of` is asked to modify his/her lifestyle ( <span class="underline">diet, salt intake reduction, moderate exercise</span> ) `types of`, if the patient has been in a MDS for a significant period, he/she is prescribed with <span class="underline">one</span> `number of` drug to <span class="underline">minimal</span> `amount of` dosage, while the patient is not improving the dosage is increased with fix increments.
    -   **Knowledge:** if patient is in MDS stage then ask to change lifestyle
    -   **Knowledge:** if patient is in MDS stage for a long time then prescribe minimal dose of a drug
    -   **Knowledge:** if patient is in MDS stage for a long time and he doesn&rsquo;t improve then increase dosage by fix increments
    -   **Know-how:** it&rsquo;s a rule, or better a procedure describing a sequence of steps dealing with multiple scenarios
5.  If a <span class="underline">maximal</span> `amount of` dosage is reached, then a second drug to <span class="underline">minimal</span> `amount of` dosage is prescribed
    -   **Knowledge:** if dosage is maximal then prescribe second drug at minimal dosage
    -   **Know-how:** part of the previous procedure
6.  Patients can reach treatments with <span class="underline">4</span> `number of` drugs
    -   **Knowledge:** if dosage is maximal then prescribe second drug at minimal dosage
    -   **Know-how:** can be seen as a part of the previous procedure
    -   **Know-what:** or as a general fact
7.  Patients that arrive in <span class="underline">highly dangerous</span> `type of` stage ( <span class="underline">HDS</span> ) `type of` are directly prescribed with <span class="underline">one</span> `number of` drug and recommended lifestyle changes.
    -   **Know-what:** it&rsquo;s a rule


<a id="orgec1dabe"></a>

# TODO Knowledge Representation


<a id="orgbdcac3d"></a>

# TODO Knowledge Engineering


<a id="org7a5ea9a"></a>

# TODO Knowledge Representation in the Web
